import pandas as pd

# Завантажуємо датафрейм 
df = pd.read_csv('GoogleApps.csv')

df.info()
#print(df.head())
print(df.tail())
#print(df[df["Rating"]>4.9]&(df["Type"]=="Free"["Installs"].mean())
print(df[(df["Rating"]>4.9)&(df["Type"]=="Free")]["Installs"].mean())
print(round(df['Installs'].median()))
print(df[(df["Rating"]>4.9)&(df["Type"]=="Free")]["App"].min())
# Як називається програма, розташована першим у наборі даних?


# До якої категорії відноситься додаток, розташований останнім у наборі даних?


# Скільки стовпців міститься у наборі даних?
# Дані якого типу зберігаються у кожному зі стовпців?


# Вкажіть середнє арифметичне та медіану розміру додатків (Size)
# Скільки коштує найдорожчий додаток?
# *Вкажіть середнє арифметичне та медіану кількості установок програм (Installs)
